In [9]:
import numpy as np

In [10]:
import pandas as pd

In [11]:
df=pd.DataFrame({'Day':[1,2,3,4],'Rusting level':['Less','Average','Low','High']})
df

   Day Rusting level
0    1          Less
1    2       Average
2    3           Low
3    4          High

In [12]:
df1=df.set_index('Day')
df1

    Rusting level
Day
1            Less
2         Average
3             Low
4            High

In [13]:
df.set_index("Day", inplace=True)
print(df)

    Rusting level
Day
1            Less
2         Average
3             Low
4            High

In [14]:
df=pd.DataFrame({'Names':['Jay','Box','Ada','Kilo','kada','dSA'],'Attributes':[12,23,34,12,45,56]})
df

  Names  Attributes
0   Jay          12
1   Box          23
2   Ada          34
3  Kilo          12
4  kada          45
5   dSA          56

In [15]:
df.head(2)

  Names  Attributes
0   Jay          12
1   Box          23

In [16]:
df.tail()

  Names  Attributes
1   Box          23
2   Ada          34
3  Kilo          12
4  kada          45
5   dSA          56

In [17]:
df.tail(3)

  Names  Attributes
3  Kilo          12
4  kada          45
5   dSA          56